Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/rcon.h
/* -------- RCON_RNMICONSET : (RCON Offset: 0x88) (R/W 32)  -------- */
#define RCON_RNMICONSET_RESETVALUE            _UINT32_(0x00)                                       /*  (RCON_RNMICONSET)   Reset Value */

#define RCON_RNMICONSET_Msk                   _UINT32_(0x00000000)                                 /* (RCON_RNMICONSET) Register Mask  */


/* -------- RCON_RNMICONINV : (RCON Offset: 0x8C) (R/W 32)  -------- */
#define RCON_RNMICONINV_RESETVALUE            _UINT32_(0x00)                                       /*  (RCON_RNMICONINV)   Reset Value */

#define RCON_RNMICONINV_Msk                   _UINT32_(0x00000000)                                 /* (RCON_RNMICONINV) Register Mask  */


/* RCON register offsets definitions */
#define RCON_RCON_REG_OFST             _UINT32_(0x60)      /* (RCON_RCON) RESET CONTROL REGISTER Offset */
#define RCON_RCONCLR_REG_OFST          _UINT32_(0x64)      /* (RCON_RCONCLR)  Offset */
#define RCON_RCONSET_REG_OFST          _UINT32_(0x68)      /* (RCON_RCONSET)  Offset */
#define RCON_RCONINV_REG_OFST          _UINT32_(0x6C)      /* (RCON_RCONINV)  Offset */
#define RCON_RSWRST_REG_OFST           _UINT32_(0x70)      /* (RCON_RSWRST) SOFTWARE RESET REGISTER Offset */
#define RCON_RSWRSTCLR_REG_OFST        _UINT32_(0x74)      /* (RCON_RSWRSTCLR)  Offset */
#define RCON_RSWRSTSET_REG_OFST        _UINT32_(0x78)      /* (RCON_RSWRSTSET)  Offset */
#define RCON_RSWRSTINV_REG_OFST        _UINT32_(0x7C)      /* (RCON_RSWRSTINV)  Offset */
#define RCON_RNMICON_REG_OFST          _UINT32_(0x80)      /* (RCON_RNMICON) NMI CONTROL REGISTER Offset */
#define RCON_RNMICONCLR_REG_OFST       _UINT32_(0x84)      /* (RCON_RNMICONCLR)  Offset */
#define RCON_RNMICONSET_REG_OFST       _UINT32_(0x88)      /* (RCON_RNMICONSET)  Offset */
#define RCON_RNMICONINV_REG_OFST       _UINT32_(0x8C)      /* (RCON_RNMICONINV)  Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* RCON register API structure */
typedef struct
{  /*  */
  __I   uint8_t                        Reserved1[0x60];
  __IO  uint32_t                       RCON_RCON;          /* Offset: 0x60 (R/W  32) RESET CONTROL REGISTER */
  __IO  uint32_t                       RCON_RCONCLR;       /* Offset: 0x64 (R/W  32)  */
  __IO  uint32_t                       RCON_RCONSET;       /* Offset: 0x68 (R/W  32)  */
  __IO  uint32_t                       RCON_RCONINV;       /* Offset: 0x6C (R/W  32)  */
  __O   uint32_t                       RCON_RSWRST;        /* Offset: 0x70 ( /W  32) SOFTWARE RESET REGISTER */
  __IO  uint32_t                       RCON_RSWRSTCLR;     /* Offset: 0x74 (R/W  32)  */
  __IO  uint32_t                       RCON_RSWRSTSET;     /* Offset: 0x78 (R/W  32)  */
  __IO  uint32_t                       RCON_RSWRSTINV;     /* Offset: 0x7C (R/W  32)  */
  __IO  uint32_t                       RCON_RNMICON;       /* Offset: 0x80 (R/W  32) NMI CONTROL REGISTER */
  __IO  uint32_t                       RCON_RNMICONCLR;    /* Offset: 0x84 (R/W  32)  */
  __IO  uint32_t                       RCON_RNMICONSET;    /* Offset: 0x88 (R/W  32)  */
  __IO  uint32_t                       RCON_RNMICONINV;    /* Offset: 0x8C (R/W  32)  */
} rcon_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32WM_BZ6_RCON_COMPONENT_H_ */
